Autodesk.Revit.DB.ExtensibleStorage.FieldBuilder.SetDocumentation(System.String)
Sets the documentation string for the Field.
Remarks:
While Entities may be hidden using access levels, Schemas and Fields are visible to
clients and other developers. In the interest of clarity and interoperability, you are
very strongly encouraged to provide good documentation with your Schemas.
Explain the intent of the data and how it is meant to be interpreted. It is not
useful to repeat information that can be observed directly (e.g. types and units).
Note that documentation, like all other contents of Schemas and Fields is immutable
once the add-in using the Schema is published.
documentation:
The documentation string.
Returns:
The FieldBuilder object may be used to add more details to the field.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The SchemaBuilder has already finished building the Schema.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.FieldBuilder.SetSpec(Autodesk.Revit.DB.ForgeTypeId)
Sets the spec describing the field's values.
specTypeId:
Identifier of the spec.
Returns:
The FieldBuilder object may be used to add more details to the field.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The SchemaBuilder has already finished building the Schema.
-or-
The field type does not utilize unit conversions.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.FieldBuilder.#ctor(Autodesk.Revit.DB.ExtensibleStorage.Field,Autodesk.Revit.DB.ExtensibleStorage.SchemaBuilder)
Constructs a new FieldBuilder using the field and associated SchemaBuilder object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.FieldBuilder.#ctor(Autodesk.Revit.DB.ExtensibleStorage.FieldBuilder)
Constructs a new copy of the input ESFieldBuilder object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012